@echo ==========================================================================
@echo XrossBoard用のプロジェクトファイルを作ります。
@echo ==========================================================================

cd %~dp0
@del *.vcxproj   >NUL 2>&1
@del *.filters   >NUL 2>&1
@del *.sln       >NUL 2>&1
bakefile-1.2.5.1_beta-win\bkl.exe .\xrossboard.bkl

@echo ==========================================================================
@echo お手持ちのVisualStudioでxrossboard.slnを開いてください。
@echo ==========================================================================

@pause